{
    "version": "https://jsonfeed.org/version/1",
    "title": "GH-Comeuppance",
    "description": "",
    "home_page_url": "https://kmontenegro.github.io/comeuppance",
    "feed_url": "https://kmontenegro.github.io/comeuppance/feed.json",
    "user_comment": "",
    "author": {
        "name": "Ken Montenegro"
    },
    "items": [
        {
            "id": "https://kmontenegro.github.io/comeuppance/our-model.html",
            "url": "https://kmontenegro.github.io/comeuppance/our-model.html",
            "title": "Our Model",
            "summary": "We believe that technology is nothing but a lever. Technology is not justice, technology is not equity, technology will not&hellip;",
            "content_html": "<p>We believe that technology is nothing but a lever. Technology is not justice, technology is not equity, technology will not save us. Technology can help us do our work in a more secure, inclusive, and hopefully egalitarian way.</p>\n<p>Our vision is to be a support and resource to organizations and individuals who hope to leverage technology in the way envisioned above.</p>\n<p>Currently, as a consulting practice of one, we must take a boutique approach to clients and, if we aren't a right fit, we'd be glad to recommend someone we know.</p>\n<p>Contact us if you'd like to explore a new and holistic approach to technology, data stewardship, and digital security.</p>\n",
            "author": {
                "name": "Ken Montenegro"
            },
            "tags": [
            ],
            "date_published": "2017-03-31T00:36:59-07:00",
            "date_modified": "2018-09-02T22:05:02-07:00"
        },
        {
            "id": "https://kmontenegro.github.io/comeuppance/about-ken.html",
            "url": "https://kmontenegro.github.io/comeuppance/about-ken.html",
            "title": "About Ken",
            "summary": "Ken Montenegro supports social movements using his skills as both a technologist and lawyer. He has been practicing technology with&hellip;",
            "content_html": "<p>Ken Montenegro supports social movements using his skills as both a technologist and lawyer.</p>\n<p>He has been practicing technology with nonprofits for close to 20 years. Those 20 years encompass research, planning, implementation, and evaluation of technology solutions. Ken has performed this work as both a staff member and consultant.</p>\n<p>Ken has a law degree. He provides a unique insight that attempts to help organizations have meaningful conversations about the nexus of ethical, statutory, and practical data use and retention.</p>\n<p>Ken is a board member of the <a href=\"https://www.nten.org\">Nonprofit Technology Network</a>; the <a href=\"https://www.immdef.org\">Immigrant Defenders Law Center</a>; and is National Vice-President of the <a href=\"https://www.nlg.org\">National Lawyers Guild</a>. He is also a co-founder of the <a href=\"https://www.stoplapdspying.org\">Stop LAPD Spying Coalition</a>.</p>\n<p>Current services are focused on delivering limited facilitation, training, strategy, and planning services to nonprofits. Due to capacity, we must limit our engagements.</p>\n<p>If you’d like to talk, please contact Ken: he’d love to hear about what you’re working on and hopefully collaborate. To view Ken's resume, <a href=\"https://standardresume.co/kenmontenegro\">click here</a>. Ken also enjoys <a href=\"https://www.goodreads.com/user/show/3415915-ken\">reading</a> and listening to <a href=\"https://www.last.fm/user/kmontenegro\">music</a>.</p>\n",
            "author": {
                "name": "Ken Montenegro"
            },
            "tags": [
            ],
            "date_published": "2017-03-31T00:34:45-07:00",
            "date_modified": "2018-09-02T22:05:02-07:00"
        },
        {
            "id": "https://kmontenegro.github.io/comeuppance/engagement-rates.html",
            "url": "https://kmontenegro.github.io/comeuppance/engagement-rates.html",
            "title": "Engagement Rates",
            "summary": "A retainer equal to 20% of estimated project total is required to initiate work; hourly work is due net-15 days&hellip;",
            "content_html": "<p>A retainer equal to 20% of estimated project total is required to initiate work; hourly work is due net-15 days after hours are worked. Payments made after the 15th day are penalized at a reasonable rate.</p>\n<h2>Commercial/Not Nonprofit:</h2>\n<ul>$210/hour unless pricing arranged by contract</ul>\n<h2>Nonprofit Over $3M Annual Budget:</h2>\n<ul>$185/hour unless pricing arranged by contract</ul>\n<h2>Nonprofit Less Than $3M Annual Budget:</h2>\n<ul>$165/hour unless pricing arranged by contract</ul>\n<h2>Project/contract scope price:</h2>\n<ul>Beyond half-hour, $80/hour</ul>\n",
            "author": {
                "name": "Ken Montenegro"
            },
            "tags": [
            ],
            "date_published": "2017-03-31T00:31:31-07:00",
            "date_modified": "2018-09-02T22:05:02-07:00"
        },
        {
            "id": "https://kmontenegro.github.io/comeuppance/contact.html",
            "url": "https://kmontenegro.github.io/comeuppance/contact.html",
            "title": "Contact",
            "summary": "If you would like to talk, we'd be glad to make time. Our largest available slot is Thursday. Our schedule&hellip;",
            "content_html": "<p>If you would like to talk, we'd be glad to make time. Our largest available slot is Thursday. Our schedule is largely Pacific time.</p>\n<p>Email:  kmontenegro at tutanota.com (longest response time)</p>\n<p>Wire:  @kmontenegro (medium)</p>\n<p>Twitter:  @kmontenegro (fast)</p>\n<p>No PGP/GPG?!? Yes, without training, support, and care, it's easy for folks to mess up using key-based encrypted email. I'm a strong supporter of end-to-end encrypted email provider Tutanota as it provides practical security, much as Signal does for SMS/text messaging.</p>\n",
            "author": {
                "name": "Ken Montenegro"
            },
            "tags": [
            ],
            "date_published": "2017-03-30T18:18:40-07:00",
            "date_modified": "2018-09-02T22:05:02-07:00"
        }
    ]
}
